# Handling Missing Value

In [16]:
# Here we are using the new data 
df_Miss_val = pd.read_csv('sample_dataset_missing_values.csv')
df_Miss_val

   Emp_ID            Name   Age  Gender   Salary Department Joining_Date
0     E01        John Doe  29.0    Male  50000.0         IT   15-01-2020
1     E02      Jane Smith  35.0  Female      NaN         HR   22-03-2018
2     E03     Emily Davis  28.0  Female      NaN         IT   09-07-2019
3     E04   Michael Brown  40.0    Male  80000.0    Finance          NaN
4     E05  Jessica Wilson  32.0  Female  55000.0         HR   05-02-2021
5     E06       David Lee   NaN    Male      NaN         IT   13-09-2020
6     E07     Laura White  27.0  Female  48000.0    Finance   20-01-2021
7     E08     Chris Green   NaN    Male  71000.0         IT   11-11-2019
8     E09      Sarah King  38.0  Female      NaN         HR   14-08-2017
9     E10    James Taylor  45.0    Male  90000.0    Finance   30-05-2016
10    E03     Emily Davis  28.0     NaN  62000.0         IT   09-07-2019
11    E05  Jessica Wilson  32.0  Female  55000.0        NaN   05-02-2021

## 5. Data Cleaning

#### Checking Duplicate values in dataset

In [17]:
df_Miss_val.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

`Here it does not show any duplicate value , but Emp_ID is unique column, so we will check along this attribute to finds duplicate.`

In [18]:
df_Miss_val['Emp_ID'].duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
Name: Emp_ID, dtype: bool

In [19]:
df_Miss_val['Emp_ID'].duplicated().sum()

2

In [20]:
df_Miss_val.drop_duplicates("Emp_ID")

  Emp_ID            Name   Age  Gender   Salary Department Joining_Date
0    E01        John Doe  29.0    Male  50000.0         IT   15-01-2020
1    E02      Jane Smith  35.0  Female      NaN         HR   22-03-2018
2    E03     Emily Davis  28.0  Female      NaN         IT   09-07-2019
3    E04   Michael Brown  40.0    Male  80000.0    Finance          NaN
4    E05  Jessica Wilson  32.0  Female  55000.0         HR   05-02-2021
5    E06       David Lee   NaN    Male      NaN         IT   13-09-2020
6    E07     Laura White  27.0  Female  48000.0    Finance   20-01-2021
7    E08     Chris Green   NaN    Male  71000.0         IT   11-11-2019
8    E09      Sarah King  38.0  Female      NaN         HR   14-08-2017
9    E10    James Taylor  45.0    Male  90000.0    Finance   30-05-2016

### Handling Missing Data:

df.dropna()  # Drops rows with missing values
df.fillna(0)  # Fills missing values with 0
df['Age'].fillna(df['Age'].mean(), inplace=True)  # Fills missing values with the mean

In [21]:
df_Miss_val.isnull()

    Emp_ID   Name    Age  Gender  Salary  Department  Joining_Date
0    False  False  False   False   False       False         False
1    False  False  False   False    True       False         False
2    False  False  False   False    True       False         False
3    False  False  False   False   False       False          True
4    False  False  False   False   False       False         False
5    False  False   True   False    True       False         False
6    False  False  False   False   False       False         False
7    False  False   True   False   False       False         False
8    False  False  False   False    True       False         False
9    False  False  False   False   False       False         False
10   False  False  False    True   False       False         False
11   False  False  False   False   False        True         False

In [22]:
df_Miss_val.isnull().sum()

Emp_ID          0
Name            0
Age             2
Gender          1
Salary          4
Department      1
Joining_Date    1
dtype: int64

### :Replaceing Data or Filling the data

In [23]:
import numpy as np

df_Miss_val['Salary'] = df_Miss_val['Salary'].replace(np.nan,df_Miss_val['Salary'].mean())
df_Miss_val['Salary']

0     50000.0
1     63875.0
2     63875.0
3     80000.0
4     55000.0
5     63875.0
6     48000.0
7     71000.0
8     63875.0
9     90000.0
10    62000.0
11    55000.0
Name: Salary, dtype: float64

Now , in Salary column there is no Nan values because all Nan values id filled with the mean of salary.

In [24]:
df_Miss_val.isnull().sum()

Emp_ID          0
Name            0
Age             2
Gender          1
Salary          0
Department      1
Joining_Date    1
dtype: int64

In [27]:
df_Miss_val['Age'] = df_Miss_val['Age'].replace(np.nan,df_Miss_val['Age'].mean())
df_Miss_val['Age']

0     29.0
1     35.0
2     28.0
3     40.0
4     32.0
5     33.4
6     27.0
7     33.4
8     38.0
9     45.0
10    28.0
11    32.0
Name: Age, dtype: float64

Now , in Age column there is no Nan values because all Nan values id filled with the mean of Age.

In [30]:
df_Miss_val["Joining_Date"]=df_Miss_val["Joining_Date"].fillna(method="ffill")
df_Miss_val["Joining_Date"]

0     15-01-2020
1     22-03-2018
2     09-07-2019
3     09-07-2019
4     05-02-2021
5     13-09-2020
6     20-01-2021
7     11-11-2019
8     14-08-2017
9     30-05-2016
10    09-07-2019
11    05-02-2021
Name: Joining_Date, dtype: object

In [31]:
df_Miss_val["Department"]=df_Miss_val["Department"].fillna(method="ffill")
df_Miss_val["Department"]

0          IT
1          HR
2          IT
3     Finance
4          HR
5          IT
6     Finance
7          IT
8          HR
9     Finance
10         IT
11         IT
Name: Department, dtype: object

In [32]:
df_Miss_val["Gender"]=df_Miss_val["Gender"].fillna(method="ffill")
df_Miss_val["Gender"]

0       Male
1     Female
2     Female
3       Male
4     Female
5       Male
6     Female
7       Male
8     Female
9       Male
10      Male
11    Female
Name: Gender, dtype: object

In [33]:
df_Miss_val.isnull().sum()

Emp_ID          0
Name            0
Age             0
Gender          0
Salary          0
Department      0
Joining_Date    0
dtype: int64

### Removing Duplicates:

In [38]:
cleanData=df_Miss_val.drop_duplicates("Emp_ID")
cleanData

  Emp_ID            Name   Age  Gender   Salary Department Joining_Date
0    E01        John Doe  29.0    Male  50000.0         IT   15-01-2020
1    E02      Jane Smith  35.0  Female  63875.0         HR   22-03-2018
2    E03     Emily Davis  28.0  Female  63875.0         IT   09-07-2019
3    E04   Michael Brown  40.0    Male  80000.0    Finance   09-07-2019
4    E05  Jessica Wilson  32.0  Female  55000.0         HR   05-02-2021
5    E06       David Lee  33.4    Male  63875.0         IT   13-09-2020
6    E07     Laura White  27.0  Female  48000.0    Finance   20-01-2021
7    E08     Chris Green  33.4    Male  71000.0         IT   11-11-2019
8    E09      Sarah King  38.0  Female  63875.0         HR   14-08-2017
9    E10    James Taylor  45.0    Male  90000.0    Finance   30-05-2016

## 6.  Column Transformation

In [39]:
cleanData

  Emp_ID            Name   Age  Gender   Salary Department Joining_Date
0    E01        John Doe  29.0    Male  50000.0         IT   15-01-2020
1    E02      Jane Smith  35.0  Female  63875.0         HR   22-03-2018
2    E03     Emily Davis  28.0  Female  63875.0         IT   09-07-2019
3    E04   Michael Brown  40.0    Male  80000.0    Finance   09-07-2019
4    E05  Jessica Wilson  32.0  Female  55000.0         HR   05-02-2021
5    E06       David Lee  33.4    Male  63875.0         IT   13-09-2020
6    E07     Laura White  27.0  Female  48000.0    Finance   20-01-2021
7    E08     Chris Green  33.4    Male  71000.0         IT   11-11-2019
8    E09      Sarah King  38.0  Female  63875.0         HR   14-08-2017
9    E10    James Taylor  45.0    Male  90000.0    Finance   30-05-2016

Now we will add a extra column "Status_of_Matuarity", and it will be decided on age basis.
If age> 35 then alpha and if age<35 then beta and if age<30 then gama.

In [48]:
cleanData.loc[cleanData['Age'] > 35, 'Status_of_Matuarity'] = "Alpha"
cleanData.loc[(cleanData['Age'] >= 30) & (cleanData['Age'] <= 35), 'Status_of_Matuarity'] = "Beta"
cleanData.loc[cleanData['Age'] < 30, 'Status_of_Matuarity'] = "Gamma"
cleanData

,Emp_ID,Name,Age,Gender,Salary,Department,Joining_Date,Status_of_Matuarity
0,E01,John Doe,29.0,Male,50000.0,IT,15-01-2020,Gamma
1,E02,Jane Smith,35.0,Female,63875.0,HR,22-03-2018,Beta
2,E03,Emily Davis,28.0,Female,63875.0,IT,09-07-2019,Gamma
3,E04,Michael Brown,40.0,Male,80000.0,Finance,09-07-2019,Alpha
4,E05,Jessica Wilson,32.0,Female,55000.0,HR,05-02-2021,Beta
5,E06,David Lee,33.4,Male,63875.0,IT,13-09-2020,Beta
6,E07,Laura White,27.0,Female,48000.0,Finance,20-01-2021,Gamma
7,E08,Chris Green,33.4,Male,71000.0,IT,11-11-2019,Beta
8,E09,Sarah King,38.0,Female,63875.0,HR,14-08-2017,Alpha
9,E10,James Taylor,45.0,Male,90000.0,Finance,30-05-2016,Alpha

In [1]:
import pandas as pd

data = {"Months": ["January", "February", "March", "April"]}
a = pd.DataFrame(data)

def extract(value):
    return value[0:3]

a["Short_months"] = a["Months"].map(extract)
print(a)

     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

### Concat: Concatenate DataFrames either along rows or columns.

In [ ]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
pd.concat([df1, df2])

### Merge: Merge DataFrames based on keys (similar to SQL JOIN).

In [ ]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value': [4, 5, 6]})
pd.merge(df1, df2, on='key', how='inner')

## 7. GroupBy Operations

### GroupBy: You can group data by one or more columns and then apply aggregate functions.

In [ ]:
df.groupby('City').mean()  # Group by 'City' and calculate the mean
df.groupby('City').agg({'Age': 'mean', 'Salary': 'sum'})  # Apply different aggregations

## 8. Pivot Tables
Pivot tables in Pandas are similar to pivot tables in Excel. They allow you to rearrange and summarize data.

In [ ]:
df.pivot_table(values='Age', index='City', columns='Name', aggfunc='mean')

In [51]:
n = 6
current_number = 1

for i in range(1, n):
    # Print leading asterisks
    for _ in range(i - 1):
        print("*", end=" ")

    # Print numbers in the row
    for j in range(i, n):
        print(current_number, end=" ")
        current_number += j

    # Fill the remaining row with asterisks
    for _ in range(i - 1):
        print("*", end=" ")

    # Move to the next line
    print()

1 2 4 7 11
* 16 18 21 25 *
* * 30 33 37 * *
* * * 42 46 * * *
* * * * 51 * * * *